using System;
using System.Collections.Generic;


// 格子类型枚举
public enum GridType
{
    Water = 0,    // 湖泊 - 不可通行
    Path = 1,    // 路径
    Forest = 2,   // 森林 - 减速
    Mountain = 3, // 山地 - 障碍
    Grass = 4,    // 草地 - 可通行
    Desert = 5   // 沙漠
}

public static class SceneConfig
{
    public static Dictionary<Int32, SceneConfigInfo> scene_id2data_ = new();

    public static void Init()
    {
        List<SceneConfigInfo> scene_list = new()
        {
            new(){
                scene_id_ = 1001,
                width_ = 20,
                height_ = 20,
                grids_ = new Int32[20, 20]
                {
                    {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 },
                    {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 },
                    {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 },
                    {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 },
                    {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 },
                    {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 },
                    {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 },
                    {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 },
                    {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 },
                    {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 },
                    {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 },
                    {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 },
                    {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 },
                    {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 },
                    {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 },
                    {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 },
                    {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 },
                    {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 },
                    {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 },
                    {1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 },
                }
            },

        };

        for (int i = 0; i < scene_list.Count; ++i)
        {
            scene_id2data_[scene_list[i].scene_id_] = scene_list[i];
        }
    }

    public static SceneConfigInfo GetSceneConfigInfo(Int32 scene_id)
    {
        if (scene_id2data_.ContainsKey(scene_id))
        {
            return scene_id2data_[scene_id];
        }

        return null;
    }

}
